In [58]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({
'key': ['A', 'B', 'C'],
'value1': [1, 2, 3]
})

df2 = pd.DataFrame({
'key': ['A', 'B', 'D'],
'value2': [4, 5, 6]
})

print("df1\n",df1)
print("df2\n",df2)

df1
   key  value1
0   A       1
1   B       2
2   C       3
df2
   key  value2
0   A       4
1   B       5
2   D       6

In [59]:
pd.merge(df1,df2, on = "key")

  key  value1  value2
0   A       1       4
1   B       2       5

In [60]:
pd.merge(df1, df2, on = "key", how = "outer")

  key  value1  value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [61]:
df1 = pd.DataFrame({
'A': ['foo', 'bar'],
'B': [1, 2]
})

df2 = pd.DataFrame({
'A': ['baz', 'qux'],
'B': [3, 4]
})

print("df1\n",df1)
print("df2\n",df2)

df1
      A  B
0  foo  1
1  bar  2
df2
      A  B
0  baz  3
1  qux  4

In [62]:
pd.concat([df1,df2])

pd.concat([df1,df2], ignore_index = False, keys=["A","B"])

       A  B
A 0  foo  1
  1  bar  2
B 0  baz  3
  1  qux  4

In [63]:
#Unisci df1 e df2 sulle colonne 'chiave1' e 'chiave2' includendo tutte le righe di df1. Qual Ã¨ il DataFrame risultante?

df1 = pd.DataFrame({
'chiave1': ['K0', 'K1', 'K2'],
'chiave2': ['K0', 'K1', 'K0'],
'A': ['A0', 'A1', 'A2']
})

df2 = pd.DataFrame({
'chiave1': ['K0', 'K1', 'K3'],
'chiave2': ['K0', 'K0', 'K0'],
'B': ['B0', 'B1', 'B3']
})

print("df1\n",df1,"\n")
print("df2\n",df2)

df1
   chiave1 chiave2   A
0      K0      K0  A0
1      K1      K1  A1
2      K2      K0  A2

df2
   chiave1 chiave2   B
0      K0      K0  B0
1      K1      K0  B1
2      K3      K0  B3

In [64]:
pd.merge(df1,df2, on = ["chiave1", "chiave2"], how = "left")

  chiave1 chiave2   A    B
0      K0      K0  A0   B0
1      K1      K1  A1  NaN
2      K2      K0  A2  NaN

In [65]:
df1.combine_first(df2)

    A   B chiave1 chiave2
0  A0  B0      K0      K0
1  A1  B1      K1      K1
2  A2  B3      K2      K0

In [66]:
#Combina df1 e df2 affiancandoli, allineando gli indici.

df1 = pd.DataFrame({
'A': ['A0', 'A1', 'A2'],
'B': ['B0', 'B1', 'B2']
}, index=[0, 1, 2])

df2 = pd.DataFrame({
'C': ['C0', 'C1', 'C2'],
'D': ['D0', 'D1', 'D2']
}, index=[0, 2, 3])

print("df1\n",df1,"\n")
print("df2\n",df2)

df1
     A   B
0  A0  B0
1  A1  B1
2  A2  B2

df2
     C   D
0  C0  D0
2  C1  D1
3  C2  D2

In [67]:
pd.concat([df1,df2], axis = "columns", ignore_index = False)

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1  NaN  NaN
2   A2   B2   C1   D1
3  NaN  NaN   C2   D2

In [68]:
#Esercizio 1: Unisci prima df1 e df2 includendo solo le chiavi comuni.
#Poi, unisci il risultato con df3 includendo tutte le chiavi di df3.

df1 = pd.DataFrame({
'chiave': ['K0', 'K1', 'K2', 'K3'],
'A': ['A0', 'A1', 'A2', 'A3']
})

df2 = pd.DataFrame({
'chiave': ['K0', 'K1', 'K2'],
'B': ['B0', 'B1', 'B2']
})

df3 = pd.DataFrame({
'chiave': ['K1', 'K2', 'K4'],
'C': ['C1', 'C2', 'C4']
})

print("df1\n",df1,"\n")
print("df2\n",df2,"\n")
print("df3\n",df3)

df1
   chiave   A
0     K0  A0
1     K1  A1
2     K2  A2
3     K3  A3

df2
   chiave   B
0     K0  B0
1     K1  B1
2     K2  B2

df3
   chiave   C
0     K1  C1
1     K2  C2
2     K4  C4

In [69]:
merged_1_2 = pd.merge(df1,df2, on = "chiave")

print("Merge df1-df2:\n",merged_1_2)

Merge df1-df2:
   chiave   A   B
0     K0  A0  B0
1     K1  A1  B1
2     K2  A2  B2

In [70]:
pd.merge(merged_1_2, df3, on="chiave", how="right")

  chiave    A    B   C
0     K1   A1   B1  C1
1     K2   A2   B2  C2
2     K4  NaN  NaN  C4

In [71]:
#Esercizio 2: Riorganizza il DataFrame in modo che ogni categoria diventi una colonna e i valori siano distribuiti di conseguenza per ogni data.

data = {
'Data': ['2024-01', '2024-01', '2024-02', '2024-02'],
'Categoria': ['A', 'B', 'A', 'B'],
'Valore': [10, 20, 15, 25]
}

df = pd.DataFrame(data)

df

      Data Categoria  Valore
0  2024-01         A      10
1  2024-01         B      20
2  2024-02         A      15
3  2024-02         B      25

In [72]:
pivot_df = df.pivot(index = "Data", columns='Categoria', values='Valore')

pivot_df

Categoria   A   B
Data
2024-01    10  20
2024-02    15  25

In [73]:
#Esercizio 3: Crea una tabella pivot che mostri la somma delle vendite per ogni venditore e mese.

data = {
'Venditore': ['Alice', 'Bob', 'Alice', 'Bob', 'Charlie','Alice', 'Bob', 'Alice', 'Bob', 'Charlie'],
'Mese': ['Gennaio', 'Gennaio', 'Febbraio', 'Febbraio', 'Gennaio','Gennaio', 'Gennaio', 'Febbraio', 'Febbraio', 'Gennaio'],
'Vendite': [200, 150, 300, 250, 100,200, 150, 300, 250, 100]
}

df = pd.DataFrame(data)

df

  Venditore      Mese  Vendite
0     Alice   Gennaio      200
1       Bob   Gennaio      150
2     Alice  Febbraio      300
3       Bob  Febbraio      250
4   Charlie   Gennaio      100
5     Alice   Gennaio      200
6       Bob   Gennaio      150
7     Alice  Febbraio      300
8       Bob  Febbraio      250
9   Charlie   Gennaio      100

In [74]:
pivot_df = df.pivot_table(index = "Venditore", columns='Mese', values='Vendite', aggfunc = "count")

pivot_df

Mese       Febbraio  Gennaio
Venditore
Alice           2.0      2.0
Bob             2.0      2.0
Charlie         NaN      2.0

In [75]:
pivot_df = df.pivot_table(index = "Venditore", columns='Mese', values='Vendite', aggfunc = sum)

pivot_df

C:\Users\stefano\AppData\Local\Temp\ipykernel_16928\1257249063.py:1: FutureWarning: The provided callable <built-in function sum> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  pivot_df = df.pivot_table(index = "Venditore", columns='Mese', values='Vendite', aggfunc = sum)

Mese       Febbraio  Gennaio
Venditore
Alice         600.0    400.0
Bob           500.0    300.0
Charlie         NaN    200.0